[
  {
    "title": "Freelance Fullstack Software Engineer",
    "company": "tverderesi.dev",
    "period": "SEP/2022 - Current",
    "location": "Curitiba - PR, Brasil (Remote)",
    "area": "Software Engineering",
    "brief": "I work freelance for some clients.",
    "projects": [
      {
        "status": "In Progress",
        "title": "Forestask",
        "subtitle": "(Formely Florestarefa)",
        "picture": "forestask.png",
        "href": "https://florestarefa.vercel.app/",
        "client": "Myself/Learning purposes.",
        "mainGoal": "Create a student friendly PWA with gamified elements which doubles as a Learning Management System for the school staff.",
        "details": "I conceptualized Florestarefa during a Hackathon in 2022. Then I built it as a prototype using HTML, CSS and JS, and now I’m building it using the MERN (MongoDB, Express, React and Node.js) stack and GraphQL for data requests.",
        "outcomes": "First prototype in HTML, CSS and JS. Student UI prototype in ReactJS and JSONServer. Partially complete PWA with login, registration and admin using the MERNG stack.",
        "tech": "MongoDB, Typescript, ReactJS, Framer, Tailwind, Node.js, GraphQL, Apollo Server and Client, Vercel."
      },
      {
        "status": "In Progress",
        "title": "GK Empreendimentos",
        "picture": "GK.png",
        "subtitle": "",
        "href": "https://gk-emps.vercel.app/",
        "client": "GK, a high-end condominiums developer in Santa Catarina, Brazil.",
        "mainGoal": "Refactor a WordPress website into a SPA using ReactJS in the front-end and AWS Lambda, while also providing a CMS for it.",
        "details": "I am spearheading the front-end design and CMS conception and execution while being mentored on the backend and infrastructure implementation by a Senior Software Engineer. I also worked out a data structure for each building selling information so it can be updated easily and quickly.",
        "outcomes": "Partially Complete SPA. The generic frame for displaying each building’s information is ready, currently working on the company page and CMS development.",
        "tech": "ReactJS, AWS Lambda, Typescript, Node.js, Vercel."
      },
      {
        "status": "Completed",
        "title": "",
        "picture": "tverderesi.png",
        "subtitle": "",
        "href": "https://tverderesi.dev/",
        "mainGoal": "Create a personal website to showcase my work and skills.",
        "details": "I am building this website using Astro, a new static site builder that uses ReactJS, Vue, Svelte and Markdown. I'm also planning to implement serverless functions to fetch content in the future.",
        "outcomes": "Complete website.",
        "tech": "Astro, ReactJS, Tailwind, Vercel."
      },
      {
        "status": "Completed",
        "title": "Hi World! Social Network",
        "picture": "hiworld.png",
        "subtitle": "Come and say Hi! to the world.",
        "href": "https://hiworldsocial.vercel.app/",
        "client": "Myself/Learning purposes.",
        "mainGoal": "Create a social network with a focus on user experience and accessibility, while also learning new technologies.",
        "details": "I built this project using the MERN stack and GraphQL for data requests. I also implemented ",
        "outcomes": "Complete social network with login, registration, posts, comments, likes, profile editing and deletion, and more.",
        "tech": "MongoDB, Typescript, ReactJS, Semantic UI, Node.js, GraphQL, Apollo Server and Client, Vercel."
      }
    ]
  },
  {
    "title": "FOUNDER AND SERVER MAINTENANCE",
    "company": "Dord English School",
    "brief": "Online-First Business English School",
    "period": "MAR/2020 - MAY/2022",
    "location": "Curitiba, PR - Brasil (Remote)",
    "area": "Education and Technology",
    "projects": [
      {
        "title": "Moodle Server Deployment and Maintenance",
        "href": "",
        "client": "Dord",
        "status": "Completed",
        "mainGoal": "Deploy a Moodle Server and maintain it with zero cost as long as possible.",
        "details": "I was responsible for deploying the Moodle server and maintaining it while keeping in mind the School had $0 to invest in server maintenance when it was founded. I chose to use Google Cloud Platform because it had free credit for 12 months, which was enough time for the school to have funds to keep the server running. I chose a low code approach because maintaining the server was a secondary assignment that I did for free. I taught myself how to use GCP, Compute Engine and Data Buckets to backup the servers. I also implemented Google’s OAuth2 login system to make the login process easier for students and teachers.",
        "outcomes": "The Moodle server which was used to apply tests to grade students.",
        "tech": "Google Cloud Platform, PHP"
      },
      {
        "title": "Data Good Practices Training",
        "href": "",
        "client": "Dord",
        "status": "Completed",
        "mainGoal": "Train staff to effectively use the Moodle server while keeping good practices in inserting and keeping data.",
        "details": "I taught the teachers at Dord how to create questions for the question bank and to use a tag system that I created, which was human-readable. The tagging system was created as a foundation to implement AI-driven granular grading and studying suggestions as a long-term goal. I crafted video lessons and a manual for future reference. I also taught them how to navigate the system, create cohorts, tests, and everything they needed to keep their classes running properly.",
        "outcomes": "A tagging system and a training course for the teachers.",
        "tech": "Adobe Premiere, Microsoft Office, Moodle"
      }
    ]
  }
]
